<a href="https://colab.research.google.com/github/Mgobeaalcoba/Full_Pandas/blob/main/datatypes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.5'

In [ ]:
!pip install --upgrade pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Collecting pandas
  Downloading pandas-1.3.4-cp37-cp37m-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.3 MB)
     |████████████████████████████████| 11.3 MB 4.1 MB/s
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pandas
  Attempting uninstall: pandas
    Found existing installation: pandas 1.1.5
    Uninstalling pandas-1.1.5:
      Successfully uninstalled pandas-1.1.5
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
google-colab 1.0.0 requires pandas~=1.1.0; python_version >= "3.0", but you have pandas 1.3.4 which is incompatible.
Successfully installed pandas-1.3.4

In [3]:
dir_pandas = '/content/drive/My Drive/Colab Notebooks/db/{}'
dir_pandas

'/content/drive/My Drive/Colab Notebooks/db/{}'

**Muy importante: Antes de leer el archivo debo conectar mi colab con mi google drive**

In [4]:
from google.colab import drive # Codigo para poder acceder al contenido de nuestro google drive
drive.mount("/content/drive")

Mounted at /content/drive

In [5]:
df_meteorites = pd.read_csv(dir_pandas.format("Meteorite_Landings.csv"))
df_meteorites

             name     id nametype  ...    reclat    reclong             GeoLocation
0          Aachen      1    Valid  ...  50.77500    6.08333       (50.775, 6.08333)
1          Aarhus      2    Valid  ...  56.18333   10.23333    (56.18333, 10.23333)
2            Abee      6    Valid  ...  54.21667 -113.00000      (54.21667, -113.0)
3        Acapulco     10    Valid  ...  16.88333  -99.90000       (16.88333, -99.9)
4         Achiras    370    Valid  ... -33.16667  -64.95000     (-33.16667, -64.95)
...           ...    ...      ...  ...       ...        ...                     ...
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[45716 rows x 10 columns]

In [6]:
df_meteorites.head()

       name   id nametype  ...    reclat    reclong           GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775, 6.08333)
1    Aarhus    2    Valid  ...  56.18333   10.23333  (56.18333, 10.23333)
2      Abee    6    Valid  ...  54.21667 -113.00000    (54.21667, -113.0)
3  Acapulco   10    Valid  ...  16.88333  -99.90000     (16.88333, -99.9)
4   Achiras  370    Valid  ... -33.16667  -64.95000   (-33.16667, -64.95)

[5 rows x 10 columns]

In [7]:
df_meteorites.tail()

             name     id nametype  ...    reclat    reclong             GeoLocation
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[5 rows x 10 columns]

In [8]:
df_meteorites.head(15)

                   name   id  ...    reclong           GeoLocation
0                Aachen    1  ...    6.08333     (50.775, 6.08333)
1                Aarhus    2  ...   10.23333  (56.18333, 10.23333)
2                  Abee    6  ... -113.00000    (54.21667, -113.0)
3              Acapulco   10  ...  -99.90000     (16.88333, -99.9)
4               Achiras  370  ...  -64.95000   (-33.16667, -64.95)
5              Adhi Kot  379  ...   71.80000          (32.1, 71.8)
6   Adzhi-Bogdo (stone)  390  ...   95.16667  (44.83333, 95.16667)
7                  Agen  392  ...    0.61667   (44.21667, 0.61667)
8                Aguada  398  ...  -65.23333    (-31.6, -65.23333)
9         Aguila Blanca  417  ...  -64.55000   (-30.86667, -64.55)
10     Aioun el Atrouss  423  ...   -9.57028  (16.39806, -9.57028)
11                  Aïr  424  ...    8.38333   (19.08333, 8.38333)
12      Aire-sur-la-Lys  425  ...    2.33333   (50.66667, 2.33333)
13                Akaba  426  ...   35.05000     (29.51667, 35.05)
14             Akbarpur  427  ...   77.95000     (29.71667, 77.95)

[15 rows x 10 columns]

In [9]:
df_meteorites.sample(10)

                         name     id  ...    reclong             GeoLocation
25985     Miller Range 090908  55192  ...    0.00000              (0.0, 0.0)
10686  Elephant Moraine 90670   9079  ...  156.42350   (-76.27974, 156.4235)
4431             Asuka 881440   4149  ...   26.00000           (-72.0, 26.0)
36916     Sayh al Uhaymir 011  23203  ...   57.28850     (21.00333, 57.2885)
38957            Yamato 74529  24907  ...   35.66667         (0.0, 35.66667)
25934     Miller Range 090857  56022  ...    0.00000              (0.0, 0.0)
9198           El Atchane 004   7781  ...    4.23528     (29.76306, 4.23528)
27854   Northwest Africa 2880  31167  ...        NaN                     NaN
20082       Lewis Cliff 86169  13107  ...  161.37228  (-84.25865, 161.37228)
42791            Yamato 86022  29528  ...   35.66667       (-71.5, 35.66667)

[10 rows x 10 columns]

In [10]:
df_meteorites.describe() # Me muestra medidas de tendencia central de mis variables estadisticas

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

In [11]:
df_meteorites.size # Me muestra la cantidad total de registros de mi database

457160

In [12]:
df_meteorites.shape # Me muestra filas por columnas

(45716, 10)

**Para poder ver el .describe sin notación cientifica podemos correr el siguiente codigo: **

In [13]:
pd.options.display.float_format="{:,.1f}".format # Significa que quiero comas para separar las unidades de mil y 1 solo decimal luego del punto.

In [14]:
df_meteorites.describe()

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

In [15]:
df_meteorites.describe(include="all") # Me muestra ademas de la medidas de tendencia central información de mis variables tipo texto.

                          name       id nametype  ...   reclat  reclong GeoLocation
count                    45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique                   45716      nan        2  ...      nan      nan       17100
top     Grove Mountains 052978      nan    Valid  ...      nan      nan  (0.0, 0.0)
freq                         1      nan    45641  ...      nan      nan        6214
mean                       NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std                        NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min                        NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%                        NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%                        NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%                        NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max                        NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

In [16]:
df_meteorites.info() # Me muestra de que tipo son mis variables. Veo los strings como objects

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [17]:
df_meteorites.convert_dtypes().dtypes # Con este comando veo mis strings como strings

name            string
id               Int64
nametype        string
recclass        string
mass (g)       float64
fall            string
year            string
reclat         float64
reclong        float64
GeoLocation     string
dtype: object

**¿Qué es una variable categórica y para que sirve? **

In [19]:
df_meteorites.nunique() # nunique me muestra la cantidad de valores unicos que tiene cada variable

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

**Nos encontramos con que tenemos dos variables: nametype y fall que tienen solamente dos valores distintos. Pero no son boolenana. En general son variables categoricas. Veamos entonces cuales son: **

In [20]:
df_meteorites["fall"]

0         Fell
1         Fell
2         Fell
3         Fell
4         Fell
         ...
45711    Found
45712    Found
45713    Found
45714    Found
45715    Found
Name: fall, Length: 45716, dtype: object

In [21]:
df_meteorites["nametype"].sample(15)

36062    Valid
29187    Valid
27740    Valid
12097    Valid
4509     Valid
19496    Valid
18462    Valid
26802    Valid
42093    Valid
9771     Valid
5426     Valid
13456    Valid
31470    Valid
23692    Valid
27722    Valid
Name: nametype, dtype: object

In [22]:
df_meteorites[["fall","nametype"]].sample(15)

        fall nametype
12384  Found    Valid
17797  Found    Valid
33052  Found    Valid
2332   Found    Valid
24127  Found    Valid
12967  Found    Valid
14634  Found    Valid
22891  Found    Valid
17249  Found    Valid
10010  Found    Valid
40864  Found    Valid
14234  Found    Valid
13189  Found    Valid
43763  Found    Valid
1092    Fell    Valid

**Entonces las voy a renombrar como variables categoricas de la siguiente forma:**

In [23]:
df_meteorites[["fall","nametype"]] = df_meteorites[["fall","nametype"]].astype("category")

**Veamos ahora los tipos de variables con la función dtypes**

In [24]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

**Puedo ver que valores componen la categoria con la función unique()**

In [25]:
df_meteorites["fall"].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [26]:
df_meteorites["nametype"].unique()

['Valid', 'Relict']
Categories (2, object): ['Valid', 'Relict']

In [ ]:
df_meteorites["year"].unique()

**Puedo saber tmb la frecuencia con que aparece cada una de los valores en mi variable con la función .value_counts()**

In [28]:
df_meteorites["fall"].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [29]:
df_meteorites["nametype"].value_counts()

Valid     45641
Relict       75
Name: nametype, dtype: int64

**Podemos convertir nuestras variables categoricas a variables dummies. Es decir variables cuyo valor es 1 o 0 y esto nos sirve para numerizar nuestras variables tipo strings**

In [30]:
pd.get_dummies(df_meteorites["fall"])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

**Tmb puedo crear nuevas columnas con la siguiente sintaxis... Voy a hacer una columna nueva rellena de "1"**

In [31]:
df_meteorites["ones"] = 1
df_meteorites

             name     id nametype  ... reclong             GeoLocation ones
0          Aachen      1    Valid  ...     6.1       (50.775, 6.08333)    1
1          Aarhus      2    Valid  ...    10.2    (56.18333, 10.23333)    1
2            Abee      6    Valid  ...  -113.0      (54.21667, -113.0)    1
3        Acapulco     10    Valid  ...   -99.9       (16.88333, -99.9)    1
4         Achiras    370    Valid  ...   -65.0     (-33.16667, -64.95)    1
...           ...    ...      ...  ...     ...                     ...  ...
45711  Zillah 002  31356    Valid  ...    17.0       (29.037, 17.0185)    1
45712      Zinder  30409    Valid  ...     9.0     (13.78333, 8.96667)    1
45713        Zlin  30410    Valid  ...    17.7       (49.25, 17.66667)    1
45714   Zubkovsky  31357    Valid  ...    41.5     (49.78917, 41.5046)    1
45715  Zulu Queen  30414    Valid  ...  -115.7  (33.98333, -115.68333)    1

[45716 rows x 11 columns]

**Combinando mi variable dummie con la creación de nuevas columnas puedo incorporar mi dummie a mi dataframe de la siguiente manera: **

In [32]:
df_meteorites[["fell","found"]] = pd.get_dummies(df_meteorites["fall"])

In [33]:
df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

**¿Como convertir una variable tipo string con datos de fechas a una variable tipo datetime?**

In [34]:
df_meteorites["year"]

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

In [35]:
pd.to_datetime(
df_meteorites["year"],
errors = "coerce",
format = "%m/%d/%Y %H:%M:%S %p" #defino el formato de la fecha primero, luego la hora y luego el tipo de hora: pm o am
)

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

In [36]:
df_meteorites["year"] = pd.to_datetime(
df_meteorites["year"],
errors = "coerce",
format = "%m/%d/%Y %H:%M:%S %p" 
)

In [37]:
df_meteorites.dtypes

name                   object
id                      int64
nametype             category
recclass               object
mass (g)              float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            object
ones                    int64
fell                    uint8
found                   uint8
dtype: object

**Listo!!! Year es un datetime64**

**¿Como re escribir el nombre de una columna? **

In [38]:
df_meteorites.rename(columns={"mass (g)":"mass"},inplace=True) #El argumento inplace=True es para guardar los cambios directamente en mi file

In [39]:
df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

In [40]:
list(df_meteorites) # Forma rapida de ver el nombre de mis columnas

['name',
 'id',
 'nametype',
 'recclass',
 'mass',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation',
 'ones',
 'fell',
 'found']

**Para eliminar columnas o filas (dos tipos de axis en un dataframe) se usa el metodo .drop(...) de la siguiente forma:**

In [ ]:
df_meteorites.drop(["ones"],axis=1,inplace=True)

In [45]:
df_meteorites.head()

       name   id nametype  ...           GeoLocation  fell found
0    Aachen    1    Valid  ...     (50.775, 6.08333)     1     0
1    Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
2      Abee    6    Valid  ...    (54.21667, -113.0)     1     0
3  Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
4   Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0

[5 rows x 12 columns]

**Supongamos que quiero borrar algunas filas. Por ejemplo las pares:**

In [46]:
df_meteorites.drop([0,2,4,6]).head(10) # Por defecto pandas reconoce que el axis son las filas

                name   id nametype  ...           GeoLocation  fell found
1             Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
3           Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
5           Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
7               Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8             Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9      Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0
10  Aioun el Atrouss  423    Valid  ...  (16.39806, -9.57028)     1     0
11               Aïr  424    Valid  ...   (19.08333, 8.38333)     1     0
12   Aire-sur-la-Lys  425    Valid  ...   (50.66667, 2.33333)     1     0
13             Akaba  426    Valid  ...     (29.51667, 35.05)     1     0

[10 rows x 12 columns]

**Puedo combinar en una misma linea de codigo el borrado de columnas y filas con la siguiente sintaxis:**

In [47]:
df_meteorites.drop(columns=["id","recclass"],index=[0,2,4,6]).head()

       name nametype     mass  fall  ... reclong           GeoLocation  fell found
1    Aarhus    Valid    720.0  Fell  ...    10.2  (56.18333, 10.23333)     1     0
3  Acapulco    Valid  1,914.0  Fell  ...   -99.9     (16.88333, -99.9)     1     0
5  Adhi Kot    Valid  4,239.0  Fell  ...    71.8          (32.1, 71.8)     1     0
7      Agen    Valid 30,000.0  Fell  ...     0.6   (44.21667, 0.61667)     1     0
8    Aguada    Valid  1,620.0  Fell  ...   -65.2    (-31.6, -65.23333)     1     0

[5 rows x 10 columns]

** Buena practica : Si yo quiero trabajar sobre una copia de mi dataframe para no alterar el original entonces debo guardar una "copia profunda" de mi dataframe en mi variable a trabajar con pandas **

In [48]:
df = df_meteorites.copy(deep=True)

In [49]:
df.head()

       name   id nametype  ...           GeoLocation  fell found
0    Aachen    1    Valid  ...     (50.775, 6.08333)     1     0
1    Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
2      Abee    6    Valid  ...    (54.21667, -113.0)     1     0
3  Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
4   Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0

[5 rows x 12 columns]

**Con la copia hecha puedo realizar todas las ediciones que queramos sin miedo a perder la info original.**